InformationRegisters/ПисьмаСпаммеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ПисьмаСпаммеры</Name>
			<Comment>Адреса отправителей эл.писем со спамом</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АдресОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПисьмаСпаммеры/Ext/ManagerModule.bsl
Функция Добавить(АдресОтправителя) Экспорт
	
	ЗначениеПоУмолчанию = Ложь;
	Данные = "АдресОтправителя = "+АдресОтправителя;
	
	Доступно = ТипЗнч(АдресОтправителя) = Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(АдресОтправителя);
	
	Если Не Доступно Тогда
		Комментарий = "Ошибка в типе или заполнении арументов";
		ЗаписьЖурналаРегистрации("Добавить()", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ПисьмаСпаммеры, Данные, Комментарий);
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	МЗ=РегистрыСведений.ПисьмаСпаммеры.СоздатьМенеджерЗаписи();
	МЗ.АдресОтправителя=АдресОтправителя;
	МЗ.Прочитать();
	Если МЗ.Выбран() Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	МЗ.АдресОтправителя=АдресОтправителя;
	МЗ.ДатаДобавления = ТекущаяДата();
	
	Попытка
		МЗ.Записать();
	Исключение
		Комментарий="Ошибка записи: "+ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Добавить()", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ПисьмаСпаммеры, Данные, Комментарий);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции
